import { pipeline } from '@xenova/transformers';
import wavefile from 'wavefile';
import fs from 'fs';

// Create a text-to-speech pipeline
const synthesizer = await pipeline('text-to-speech', 'Xenova/mms-tts-hin', {
    quantized: false, // Remove this line to use the quantized version (default)
});

// Generate speech
const output = await synthesizer(`
किसी अनजाने और दूर-दराज के जंगल में, एक सुनसान रास्ते पर, चार बच्चे – राजू, सीमा, गोपू और मीना – बहुत खोजी दिल के साथ चल रहे थे। उनकी उत्सुकता उन्हें जंगल के भीतर एक अनजानी जगह की ओर ले गयी, जिसे गुप्त जंगल कहा जाता था। इस जगह के बारे में गाँव के बुजुर्ग भी बस कहानियां ही सुनाया करते थे।
जैसे-जैसे वे और आगे बढ़े, मीना ने जमीन पर कुछ चमकते हुए पत्थरों को देखा। वे पत्थर वास्तव में रंगीन क्रिस्टल थे। राजू ने एक पत्थर उठाया और उसे ध्यान से देखा। तभी जरा सी ढिलाई और वो क्रिस्टल चमकते हुए एक प्राचीन द्वार की ओर इशारा करने लगा। बच्चों की जिज्ञासा का कोई ठिकाना नहीं रहा, और वे उस द्वार की ओर बढ़ने लगे।
द्वार पर पहुंचकर, उन्होंने देखा कि वह बंद था और उसपर कुछ पहेलियाँ लिखी हुई थीं। गोपू, जो रहस्यों का मास्टर था, ने चुटकियों में उन पहेलियों को हल कर दिया। जैसे ही उन्होंने सही जवाब बोला, द्वार धीरे-धीरे खुलने लगा।
द्वार के उस पार उन्होंने जो देखा वह अद्भुत था – एक खूबसूरत सुनहरा वाटिका, जिसमें चिड़ियों का चहचहाना, फूलों की महक, और निर्मल हवा थी।
राजू और सीमा उस वाटिका में खेलने लगे, जबकि गोपू और मीना ने उस जगह की और खोज शुरू कर दी। वे जल्दी ही वाटिका के बीचो-बीच एक सुनहरा मंदिर पाते हैं, जिसमें एक सुनहरी मूर्ति थी। मूर्ति जीवंत नजरिये से देखती हुई और आशीर्वाद देती मालूम होती थी।
तभी, एक गहरी आवाज उन के पीछे से आई। “तुम चारों ने इस जंगल का रहस्य सुलझा लिया है।” ये शब्द उसी गाँव के बुजुर्ग के थे जिन्होंने इस जंगल के रहस्य के बारे में बताया था। “और तुम्हें इसका इनाम मिलेगा। यह मंदिर हमेशा से यहां था, लेकिन केवल वह इसे देख सकता है जो दिल से निर्दोष और सच्चा हो।”
`);


const wav = new wavefile.WaveFile();
wav.fromScratch(1, output.sampling_rate, '32f', output.audio);
fs.writeFileSync('out.wav', wav.toBuffer());
